sn-induction_2D/openfoam_template_transient/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
boundary
{
    "(front|back)"
    {
        type            wedge;
    }
    defaultFaces
    {
        type    empty;
    }
    axis
    {
        type    empty;
    }
}
T
{
    boundaryField
    {
        
        freeSurf
        {
            type            fixedGradient;
            gradient           uniform 0;  // will be replaced by elmerToFoamBC
        }

        crucibleBot
        {
            type            fixedGradient;
            gradient           uniform 0;  // will be replaced by elmerToFoamBC
        }

        crucibleSide
        {
            type            fixedGradient;
            gradient           uniform 0;  // will be replaced by elmerToFoamBC
        }
        
        crysInter
        {
            type            fixedValue;
            value           uniform 0;  // will be replaced by elmerToFoamBC
        }        
    }
}


// ************************************************************************* //
