sn-induction_2D/openfoam_template_transient/system/elmerToFoamDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      elmerToFoamDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coordinatePermut    (0 1 2); // (x,y,z) -> (x,z,y)

coordStartColumn    3;

valueLabel    6;

valueName     "T";

gradientLabel    7;

gradientSize     2;

gradientName     "gradT";

mapMethod       interp1; //#nearest

boundary
{
	freeSurf	    "save_line_melt_surf_relaxed.dat";
    crysInter	    "save_line_melt_crys_relaxed.dat";
    crucibleSide	"save_line_crc_melt_relaxed.dat";
    crucibleBot	    "save_line_crc_melt_relaxed.dat";
}

// Lorentz force (no rotation yet)
FLmap           1; // flag for reading
QJmap           1; // flag for reading
FLfile          "lorentz-force.csv"; // filename
coordColumn     3; // column with x coordinate (careful, no permutation is implemented yet)
heatColumn      6; // column with joule heat
QJcoef          1; // scaling factor for Teqn -> QJcoef*QJ/Qrhocp_
forceColumn     10; // column with Fx
FLcoef          1; // scaling factor for Ueqn -> Flcoef/FLrho0*FL
FLrho0          FLrho0 [1 -3 0 0 0 0 0] 6980; 
Qrhocp          Qrhocp [1 -1 -2 -1 0 0 0] 1.764e6;
